Repository: asmwarrior/namecheck
Catalog: namecheck/src/*.po
Languages: es

source: Enum type declaration
es: Declaracion de tipo enumerado

source: in
es: en

source: Enum value declaration
es: Declaracion de valor de enumerado

source: Variable declaration
es: Declaracion de variable

source: Global const declaration
es: Declaracion de constante global

source: Function declaration
es: Declaracion de funcion

source: Parameter declaration
es: Declaracion de parametro

source: Type declaration
es: Declaracion de tipo

source: Class declaration
es: Declaracion de clase

source: Struct declaration
es: Declaracion de estructura

source: Union declaration
es: Declaracion de union

source: Union value declaration
es: Declaracion de valor de union

source: Method declaration
es: Declaracion de metodo

source: Attribute declaration
es: Declaracion de atributo

source: Namespace declaration
es: Declaracion de espacio de nombre

source: Template's parameters declaration
es: Declaracion de parametros de plantilla

source: should start with lowercase
es: debe comenzar con minuscula

source: should not be written using underscores, only one underscore at the beginning is supported
es: no debe ser escrito usando guiones bajo, solamente un guion bajo al comienzo es soportado

source: should end with lowercase or digit
es: debe terminar con minuscula o digito

source: should start with an underscore followed by lowercase
es: debe comenzar con guion bajo seguido por minuscula

source: should not start with _ followed by an uppercase
es: no debe comenzar con _ seguido por una mayuscula

source: should not start with a capital E followed by a digit or an uppercase letter, since it might be used for additional error code names
es: no debe comenzar con una E mayuscula seguida por un digito o una mayuscula, puesto que quizas sea usada para nombres de codigo de error

source: should not start with either 'is' or 'to' followed by a lowercase letter since it might be used for additional character testing and conversion functions.
es: no debe comenzar con 'is' o 'to' seguido por una letra minuscula, dado que quizas sean usadas para caracteres de prueba o conevrsion de funciones

source: should not start with LC_ followed by an uppercase letter since it might be used for additional macros specifying locale attributes.
es: no debe comenzar con LC_ seguido por una letra mayuscula, porque puede ser usada para macros que especifiquen atributos de localizacion

source: should not start with SIG or SIG_ followed by an uppercase letter because those names are reserved for additional signal names or actions.
es: no debe comenzar con SIG o SIG_ seguido por una letra mayuscula puesto que esos nombres estan reservados para nombres de seniales o acciones

source: should not start with 'str', 'mem', or 'wcs' followed by a lowercase letter because those names are reserved for additional string and array functions.
es: no debe comenzar con 'str', 'mem', o 'wcs' seguido por una letra minuscula, dado que esos nombres estan reservados para cadenas y funciones

source: should not end with '_t' since that suffix is reserved for additional type names.
es: no debe terminar con _t, porque ese sufijo esta reservado para nombres adicionales de tipos

source: should start with uppercase
es: debe comenzar con mayuscula

source: should not be written using underscores, only one underscore is supported at the beginning
es: no debe ser escrito usando guiones bajo, solo un guion bajo es soportado al comienzo

source: should be written with uppercase and underscore
es: debe ser escrito con mayuscula y guin bajo

source: should end with uppercase
es: debe terminar con mayuscula
